cf/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПользователиИнтернет</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Партнеры</xr:Item>
				<xr:Item>Catalog.Грузополучатели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>(Общ) Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>(Регл) Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>(Регл) Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>(Общ) Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>(Общ) Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Comment>(Регл) Номер и дата разрешения открытия счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>(Общ) Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>(Общ) Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>(Общ) Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>(Общ) Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Bankleitzahl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/БанковскиеСчета/Ext/ManagerModule.bsl
// Функция определяет банковский счет выбранного контрагента или физического лица.
//
// Возвращает банковский счет получателя, если найден один банковский счет.
// Возвращает Неопределено, если банковский счет не найден или счетов больше одного
//
// Параметры:
//  Получатель - СправочникСсылка.Контрагенты или СправочникСсылка.ФизическиеЛица - Ссылка на получателя
//	Валюта - СправочникСсылка.Валюты - Валюта банковского счета
//
// Возвращаемое значение:
//	СправочникСсылка.БанковскиеСчетаКонтрагентов - Найденный банковский счет получателя
//
Функция ПолучитьБанковскийСчетПоУмолчанию(Получатель, Валюта = Неопределено) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка КАК БанковскийСчетПолучателя
	|ИЗ
	|	Справочник.БанковскиеСчета
	|ГДЕ
	|	Не ПометкаУдаления
	|	И Владелец = &Получатель
	|	И (ВалютаДенежныхСредств = &Валюта
	|		ИЛИ &Валюта = Неопределено)
	|УПОРЯДОЧИТЬ ПО ЗначениеПоУмолчанию Убыв
	|");
	
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 
	   И Выборка.Следующий()
	Тогда
		БанковскийСчетПолучателя = Выборка.БанковскийСчетПолучателя;
	Иначе
		БанковскийСчетПолучателя = Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
	Возврат БанковскийСчетПолучателя;

КонецФункции // ПолучитьБанковскийСчетПоУмолчанию()

// Функция получает реквизиты банковского счета.
//
// Параметры:
//  БанковскийСчет - СправочникСсылка.БанковскиеСчета - Ссылка на банковский счет
//
// Возвращаемое значение:
//	Структура - реквизиты банковского счета
//
Функция ПолучитьРеквизитыБанковскогоСчета(БанковскийСчет) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	БанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств КАК Валюта,
	|	БанковскиеСчетаКонтрагентов.ТекстНазначения КАК ТекстНазначения,
	|
	|	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаКонтрагентов.Банк КАК Банк,
	|	БанковскиеСчетаКонтрагентов.Банк.Код КАК БИК,
	|	БанковскиеСчетаКонтрагентов.Банк.КоррСчет КАК КоррСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчетаКонтрагентов
	|ГДЕ
	|	БанковскиеСчетаКонтрагентов.Ссылка = &БанковскийСчет
	|");
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Валюта = Выборка.Валюта;
		ТекстНазначения = Выборка.ТекстНазначения;
		НомерСчета = Выборка.НомерСчета;
		Банк = Выборка.Банк;
		БИК = Выборка.БИК;
		КоррСчет = Выборка.КоррСчет;
	Иначе
		Валюта = Справочники.Валюты.ПустаяСсылка();
		ТекстНазначения = "";
		НомерСчета = "";
		Банк = Неопределено;
		БИК = "";
		КоррСчет = "";
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Валюта, ТекстНазначения, НомерСчета, Банк, БИК, КоррСчет",
		Валюта,
		ТекстНазначения,
		НомерСчета,
		Банк,
		БИК,
		КоррСчет
	);
	
	Возврат СтруктураРеквизитов;

КонецФункции // ПолучитьРеквизитыБанковскогоСчета()
